OdGeMatrix3d.entry
\details
Matrix data by rows.

OdGeMatrix3d.op_FunctionCall(System.Int32,System.Int32)
\details
Returns matrix.entry[row][column] as matrix(row,column).
\param row    [in] Row.
\param column [in] Column.
\returns Matrix element.
\details
References matrix.entry[row][column] as matrix(row,column).
\param row    [in] Row.
\param column [in] Column.
\returns Reference to the matrix element.
\details
Returns a matrix element specified by the row and column.
\param row    [in] Row of a matrix. Must be in range from 0 to 3.
\param column [in] Column of a matrix. Must be in range from 0 to 3.
\returns Matrix element.
\details
Returns a reference to a matrix element specified by the row and column.
\param row    [in] Row of a matrix. Must be in range from 0 to 3.
\param column [in] Column of a matrix. Must be in range from 0 to 3.
\returns Reference to the matrix element.

OdGeMatrix3d.op_Subscript(System.Int32)
\details
Returns matrix.entry[row] as matrix[row].
\param row [in] Row.
\returns Pointer to a constant matrix row.
\details
References matrix.entry[row] as matrix[row].
\param row [in] Row.
\returns Pointer to the matrix row.
\details
Returns a pointer to a constant matrix row.
\param row [in] Row of a matrix. Must be in range from 0 to 3.
\returns Pointer to a constant matrix row.
\details
Returns a pointer to a matrix row.
\param row [in] Row of a matrix. Must be in range from 0 to 3.
\returns Pointer to the matrix row.

OdGeMatrix3d.convertToLocal(OdGeVector3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which transforms the plane specified by a normal and an
elevation.
\param normal    [in/out] Normal to the plane.
\param elevation [in/out] Elevation of the plane.
\returns Transformation matrix.
\remarks
Returns the normal and elevation of the transformed plane, as well as a 2D
transformation matrix for transforming points in the original plane
coordinates to the transformed plane coordinates.

OdGeMatrix3d.norm
\details
Returns the largest absolute value of the linear part of this matrix.
\returns The largest absolute value of the linear part of this matrix.

OdGeMatrix3d.scale
\details
Returns the scale factor of this matrix.
\returns Scale factor.
\remarks
The scale factor is the square root of the longest column vector of the
linear part of this matrix.

OdGeMatrix3d.planeToWorld(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which maps the plane coordinate system to the WCS.
\param plane [in] Plane.
\returns Transformation matrix.

OdGeMatrix3d.planeToWorld(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which maps the plane coordinate system to the WCS.
\param normal [in] Normal to the plane.
\returns Transformation matrix.
\remarks
If normal is specified, the origin of the plane is (0,0,0).

OdGeMatrix3d.worldToPlane(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which maps the WCS to the plane coordinate system.
\param plane [in] Plane.
\returns Transformation matrix.

OdGeMatrix3d.worldToPlane(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix which maps the WCS to the plane coordinate system.
\param normal [in] Normal to the plane.
\returns Transformation matrix.
\remarks
If normal is specified, the origin of the plane is (0,0,0).

OdGeMatrix3d.alignCoordSys(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerService
\details
Returns the matrix which maps the initial coordinate system defined by
fromOrigin, fromXAxis, fromYAxis and fromZAxis, to the destination
coordinate system defined by toOrigin, toXAxis, toYAxis and toZAxis.
\param fromOrigin [in] Origin of the initial coordinate system.
\param fromXAxis  [in] X-axis of the initial coordinate system.
\param fromYAxis  [in] Y-axis of the initial coordinate system.
\param fromZAxis  [in] Z-axis of the initial coordinate system.
\param toOrigin   [in] Origin of the destination coordinate system.
\param toXAxis    [in] X-axis of the destination coordinate system.
\param toYAxis    [in] Y-axis of the destination coordinate system.
\param toZAxis    [in] Z-axis of the destination coordinate system.
\returns Transformation matrix.

OdGeMatrix3d.projection(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix that parallely projects entities onto the specified plane
in the specified direction.
\param projectionPlane [in] Projection plane.
\param projectDir      [in] Projection direction.
\returns Projection matrix.

OdGeMatrix3d.mirroring(OdGeLine3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix that mirrors entities across the specified line.
\param mirrorLine [in] Mirror line entity.
\returns Mirroring matrix.

OdGeMatrix3d.mirroring(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix taht mirrors entities across the specified point.
\param mirrorPoint [in] Mirror point.
\returns Mirroring matrix.

OdGeMatrix3d.mirroring(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix that mirrors entities across the specified plane.
\param mirrorPlane [in] Mirror plane.
\returns Mirroring matrix.

OdGeMatrix3d.scaling(OdGeScale3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix that scales entities by a scale factor relatively to the
center.
\param scale  [in] Scale factor.
\param center [in] Center of scaling.
\returns Scaling matrix.

OdGeMatrix3d.scaling(System.Double,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix that scales entities by a scale factor relatively to the
center.
\param scale  [in] Scale factor.
\param center [in] Center of scaling.
\returns Scaling matrix.

OdGeMatrix3d.rotation(System.Double,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix that rotates entities by an angle about an axis passing
through the center.
\param angle  [in] Rotation angle.
\param axis   [in] Rotation axis.
\param center [in] Center of rotation.
\returns Rotation matrix.

OdGeMatrix3d.translation
\details
Returns the translation vector of this matrix.
\returns Translation vector.

OdGeMatrix3d.translation(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the matrix of the translation by a vector.
\param vect [in] Translation vector.
\returns Matrix of the translation by the vector.

OdGeMatrix3d.setToPlaneToWorld(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which maps the plane coordinate system to the
WCS, and returns a reference to this matrix.
\param plane [in] Plane.
\returns Reference to this matrix.

OdGeMatrix3d.setToPlaneToWorld(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which maps the plane coordinate system to the
WCS, and returns a reference to this matrix.
\param normal [in] Normal to the plane.
\returns Reference to this matrix.
\remarks
If the normal is specified, the origin of the plane is (0,0,0).

OdGeMatrix3d.setToWorldToPlane(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which maps the WCS to the plane coordinate
system, and returns a reference to this matrix.
\param plane [in] Plane.
\returns Reference to this matrix.

OdGeMatrix3d.setToWorldToPlane(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which maps the WCS to the plane coordinate
system, and returns a reference to this matrix.
\param normal [in] Normal to the plane.
\returns Reference to this matrix.
\remarks
If the normal is specified, the origin of the plane is (0,0,0).

OdGeMatrix3d.setToAlignCoordSys(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerSe
\details
Sets this matrix to the matrix which maps the initial coordinate system
defined by fromOrigin, fromXAxis, fromYAxis and fromZAxis, to the
destination coordinate system defined by toOrigin, toXAxis, toYAxis and
toZAxis, and returns a reference to this matrix.
\param fromOrigin [in] Origin of the initial coordinate system.
\param fromXAxis  [in] X-axis of the initial coordinate system.
\param fromYAxis  [in] Y-axis of the initial coordinate system.
\param fromZAxis  [in] Z-axis of the initial coordinate system.
\param toOrigin   [in] Origin of the destination coordinate system.
\param toXAxis    [in] X-axis of the destination coordinate system.
\param toYAxis    [in] Y-axis of the destination coordinate system.
\param toZAxis    [in] Z-axis of the destination coordinate system.
\returns Reference to this matrix.

OdGeMatrix3d.setToProjection(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which is parallely projected onto the
specified plane in the specified direction and returns a reference to this
matrix.
\param projectionPlane [in] Projection plane.
\param projectDir      [in] Projection direction.
\returns Reference to this matrix.

OdGeMatrix3d.setToMirroring(OdGeLine3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which is mirrored about the specified object
and returns a reference to this matrix.
\param mirrorLine [in] Mirror line entity.
\returns Reference to this matrix.

OdGeMatrix3d.setToMirroring(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which is mirrored about the specified object
and returns a reference to this matrix.
\param mirrorPoint [in] Mirror point.
\returns Reference to this matrix.

OdGeMatrix3d.setToMirroring(OdGePlane!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which is mirrored about the specified object
and returns a reference to this matrix.
\param mirrorPlane [in] Mirror plane.
\returns Reference to this matrix.

OdGeMatrix3d.setToScaling(OdGeScale3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which is scaled by a scale factor about the
center of scaling, and returns a reference to this matrix.
\param scale  [in] Scale factor.
\param center [in] Center of scaling.
\returns Reference to this matrix.

OdGeMatrix3d.setToScaling(System.Double,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which is scaled by a scale factor about the
center of scaling, and returns a reference to this matrix.
\param scale  [in] Scale factor.
\param center [in] Center of scaling.
\returns Reference to this matrix.

OdGeMatrix3d.setToRotation(System.Double,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which is rotated by a specified angle about
an axis passing through the center, and returns a reference to this matrix.
\param angle  [in] Rotation angle.
\param axis   [in] Rotation axis.
\param center [in] Center of rotation.
\returns Reference to this matrix.

OdGeMatrix3d.setToTranslation(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which is translated by a translation vector
and returns a reference to this matrix.
\param vect [in] Translation vector.
\returns Reference to this matrix.

OdGeMatrix3d.getCsZAxis
\details
Returns the Z-axis of the coordinate system to which this matrix maps the
WCS.
\returns Z-axis of the coordinate system.

OdGeMatrix3d.getCsYAxis
\details
Returns the Y-axis of the coordinate system to which this matrix maps the
WCS.
\returns Y-axis of the coordinate system.

OdGeMatrix3d.getCsXAxis
\details
Returns the X-axis of the coordinate system to which this matrix maps the
WCS.
\returns X-axis of the coordinate system.

OdGeMatrix3d.getCsOrigin
\details
Returns the origin of the coordinate system to which this matrix maps the
WCS.
\returns Origin of the coordinate system.

OdGeMatrix3d.getCoordSystem(OdGePoint3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns the origin, X-axis, Y-axis and Z-axis of the coordinate system to
which this matrix maps the WCS.
\param origin [out] Receives the origin of the coordinate system.
\param xAxis  [out] Receives the X-axis of the coordinate system.
\param yAxis  [out] Receives the Y-axis of the coordinate system.
\param zAxis  [out] Receives the Z-axis of the coordinate system.

OdGeMatrix3d.setCoordSystem(OdGePoint3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the matrix which maps the WCS to the coordinate system
defined by origin, X-axis, Y-axis and Z-axis, and returns a reference to
this matrix.
\param origin [in] Origin of the coordinate system.
\param xAxis  [in] X-axis of the coordinate system.
\param yAxis  [in] Y-axis of the coordinate system.
\param zAxis  [in] Z-axis of the coordinate system.
\returns Reference to this matrix.

OdGeMatrix3d.setTranslation(OdGeVector3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the translation part of the matrix to the specified vector.
\param vect [in] Translation vector.
\returns Reference to this matrix.

OdGeMatrix3d.det
\details
Returns the determinant of this matrix.
\returns Determinant value.

OdGeMatrix3d.isPerspective(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Indicates whether the matrix can be used for perspective projections.
\param tol [in] Geomentric tolerance.
\returns true if the matrix can be used for perspective projections; false
otherwise.
\remarks
Returns true if [3][0] or [3][1] or [3][2] elements have non-zero values
considering passed tolerance.

OdGeMatrix3d.isScaledOrtho(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether the column vectors of the linear part of this
matrix are mutually perpendicular within the specified tolerance.
\param tol [in] Geomentric tolerance.
\returns true if the columns vectors of the linear part of this matrix are
mutually perpendicular; false otherwise.

OdGeMatrix3d.isUniScaledOrtho(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if the columns vectors of the linear part of this
matrix are of equal length and mutually perpendicular within the specified
tolerance.
\param tol [in] Geomentric tolerance.
\returns true if the columns vectors of the linear part of this matrix are
of equal length and mutually perpendicular; false otherwise.

OdGeMatrix3d.isEqualTo(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Returns true if and only if another matrix is identical to this one within
the specified tolerance.
\param matrix [in] Matrix to compare with this matrix.
\param tol    [in] Geomentric tolerance.
\returns true if this matrix is identical to another matrix; false
otherwise.

OdGeMatrix3d.op_Inequality(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Negated comparison operator.
\param matrix [in] Matrix to compare with this matrix.
\returns true if compared matrices are not equal; false otherwise.

OdGeMatrix3d.op_Equality(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator.
\param matrix [in] Matrix to compare with this matrix.
\returns true if compared matrices are equal; false otherwise.

OdGeMatrix3d.transpose
\details
Returns the transpose of this matrix.
\returns Transpose of this matrix.

OdGeMatrix3d.transposeIt
\details
Sets this matrix to its transpose, and returns a reference to this matrix.
\returns Reference to this matrix.

OdGeMatrix3d.isSingular(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks whether this matrix is singular.
\param tol [in]  Geometric tolerance.
\returns
true if this matrix is singular, false otherwise.
\remarks
* A matrix is singular if and only if its determinant is zero within the specified tolerance.
* A singular matrix cannot be inverted.

OdGeMatrix3d.inverse(OdGeMatrix3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Double)
\details
Retrieves the inverse of this matrix.
\param inverseMatrix [out] Receives the inverse matrix.
\param tol            [in] Tolerance value.
\returns true if this matrix has an inverse; false otherwise.
\remarks
Matrix has an inverse if determinant of this matrix is not zero within tol.

OdGeMatrix3d.inverse(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Calculates inversion of this matrix.
\param tol [in] Tolerance value.
\returns Inverse of this matrix.
\remarks
Throws eInvalidInput if determinant of this matrix is less than tol.equalPoint().

OdGeMatrix3d.inverse
\details
Calculates inversion of this matrix.
\returns Inversion of this matrix.
\remarks
Throws eInvalidInput if determinant of this matrix is zero.

OdGeMatrix3d.invert
\details
Sets this matrix to its inversion.
\returns
Reference to this matrix.
\remarks
Throws eInvalidInput if determinant of this matrix is zero.

OdGeMatrix3d.setToProduct(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the product of matrix1 and matrix2, and returns a
reference to this matrix.
\param matrix1 [in] First 3D matrix that is multiplied.
\param matrix2 [in] Second 3D matrix that is multiplied.
\returns Reference to this matrix.

OdGeMatrix3d.postMultBy(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the product of this matrix and rightSide, and returns a
reference to this matrix.
\param rightSide [in] 3D matrix that will be multiplied by this matrix.
\returns Reference to this matrix.

OdGeMatrix3d.preMultBy(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets this matrix to the product of leftSide and this matrix, and returns a
reference to this matrix.
\param leftSide [in] 3D matrix that will be multiplied by this matrix.
\returns Reference to this matrix.

OdGeMatrix3d.op_MultiplicationAssignment(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Multiplication with assignment operator. Sets this matrix to the product of
this matrix and another matrix, and returns a reference to this matrix.
\param matrix [in] Another matrix to multiply this matrix by.
\returns
A reference to this OdGeMatrix3d object.

OdGeMatrix3d.op_Multiply(OdGeMatrix3d!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Multiplication operator. Returns the product of this matrix and another
matrix.
\param matrix [in] Another matrix to multiply this matrix by.
\returns Product of this matrix and another matrix.

OdGeMatrix3d.validateZero(OdGeTol!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets any values within tol of 0 to 0.
\param tol [in] Validation tolerance.
\remarks
For correcting in case that Zero is corrupted.

OdGeMatrix3d.setToIdentity
\details
Sets this matrix to the identity matrix, and returns a reference to this
matrix.
\returns Reference to this matrix.

OdGeMatrix3d.kIdentity
\details
Multiplicative identity matrix.

OdGeMatrix3d.#ctor
\details
Default constructor for objects of the OdGeMatrix3d class.
\remarks
Constructs a matrix for 3D transformation operations and sets it to
identity.